#+TITLE: Advanced C++

** const parameters
#+BEGIN_SRC C++ :flags -std=c++11 :includes <iostream>

void func(int &a) {
  std::cout << "Ref" << std::endl;
}

void func(const int &a) {
  std::cout << "Const Ref" << std::endl;
}

int main() {
  int a = 0;
  func(a); // a is lvalue
  func(1); // 1 is rvalue
}
#+END_SRC

#+RESULTS:
| Ref   |     |
| Const | Ref |

** const functions
#+BEGIN_SRC C++ :flag -std=c++11
#include <iostream>

class Dog {
public:
  void getName() { std::cout << "getName()" << std::endl; }
  void getName() const { std::cout << "getName() const" << std::endl; }
};

int main() {
  Dog d1;
  d1.getName(); // output: getName()
  const Dog d2;
  d2.getName(); // output: getName() const
}
#+END_SRC

#+RESULTS:
| getName() |       |
| getName() | const |

